
def ViewMenu():
    print("\n==========Выберете тип чисел=============\n"
          "1. рациональные\n"
          "2. комплексные\n"
          "3. бинарные\n"
          "4. Выйти")
    num = int(input("Выберите пункт меню: "))
    return num

def ViewWrite():
    number = int(input("Введите число: "))  
    return number

def ViewmenuRationalNum():
    print("\n==========Введите операцию=============\n"
          "'+' для сложения\n"
          "'-' для разности\n"
          "'*' для умножения\n"
          "'/' для умножения\n"
          "'Q' для выхода")
    
    key = input("Выберите пункт меню: ")
    return key
